<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="pandoc.css" type="text/css" />
  <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_CHTML-full" type="text/javascript"></script>
</head>
<body>
<h1 id="le-cercle-de-confusion-et-la-profondeur-de-champ">Le cercle de confusion et la profondeur de champ</h1>
<p>Un des &#233;l&#233;ment essentiel &#224; la cr&#233;ation d'une photo est la profondeur de champ. Il existe une multitude d'articles qui expliquent comment l'utiliser et l'optimiser en photographie. Ce n'est pas le but de cet article. Son but est de donner des explications visuelles sur la science qui m&#232;ne &#224; la notion la profondeur de champs.</p>
<h2 id="quelques-d&#233;finitions">Quelques d&#233;finitions</h2>
<p>Dans la suite je vais utiliser une r&#232;gle de l'optique qui nous dit que les principales propri&#233;t&#233;s d'un objectif photo, aussi complexe soit il, peuvent &#234;tre &#233;gal&#233;es par un syst&#232;me simple constitu&#233; d'une lentille et d'un d&#233;tecteur. M&#234;me si la qualit&#233; d'image d'un tel syst&#232;me sera ex&#233;crable il en reste pas moins que ses propri&#233;t&#233;s de <strong>longueur focale</strong> et <strong>ouverture</strong> sont valides et comparables &#224; celles d'un objectif beaucoup plus complexe.</p>
<h3 id="longueur-focale-et-nombre-f">Longueur focale et nombre-f</h3>
<p>Ce syst&#232;me simplifier (voir figure <a href="#ly1">ci-dessous</a>), aura donc les propri&#233;t&#233;s physique suivantes:</p>
<ul>
<li><span class="math inline">\(r\)</span> un certain rayon de courbure de la lentille.</li>
<li><span class="math inline">\(n\)</span> un certain &quot;indice de r&#233;fraction&quot; de la mati&#232;re constituant la lentille (du verre en g&#233;n&#233;ral).</li>
<li><span class="math inline">\(D\)</span> un certain diam&#232;tre de la lentille.</li>
<li>un d&#233;tecteur plan d'une certaine dimension.</li>
<li><span class="math inline">\(l\)</span> une certaine distance entre la lentille et le d&#233;tecteur.</li>
</ul>
<p>Les deux premi&#232;res propri&#233;t&#233;s <span class="math inline">\(r\)</span> et <span class="math inline">\(n\)</span>, nous n'en parlerons plus dans cet article, la combinaison des deux constituent la <strong>longueur focale</strong> <span class="math inline">\(M\)</span> de la lentille. C'est la distance entre la lentille et le point de convergence de rayons venant de l'infinie (des rayons parall&#232;les). Autrement dit, dans notre syst&#232;me si la mise au point est faite &#224; l'infinie, alors la distance <span class="math inline">\(l\)</span> entre lentille et d&#233;tecteur sera &#233;gale &#224; la longueur focale <span class="math inline">\(M\)</span>.</p>
<p>La <strong>longueur focale</strong> divis&#233;e par le diam&#232;tre de la lentille est ce que l'on appelle le nombre-f <span class="math inline">\(f\)</span>. On l'appelle parfois <strong>ouverture</strong> m&#234;me si ce terme est trompeur car il peut &#234;tre confondu avec le diam&#232;tre <span class="math inline">\(D\)</span>. Dans la suite je parlerais aussi de pupille, dans notre cas simplifi&#233; la pupille est confondu avec l'unique lentille.</p>
<h3 id="mise-au-point-cercle-de-confusion-et-profondeur-de-champ.">Mise au point, cercle de confusion et profondeur de champ.</h3>
<p>Dans les figure <a href="#ly1">ci-dessous</a>, les rayons viennent de l'infinie et le syst&#232;me est compos&#233; d'une lentille de focale 50mm et d'un diam&#232;tre de 25mm, c'est donc une 50mm f/2, le d&#233;tecteur au &quot;plan focal&quot; est de la m&#234;me taille qu'un d&#233;tecteur 'Full Frame' (plein format, 36x24mm). La distance entre la lentille et le d&#233;tecteur est telle que les rayons convergent au m&#234;me point sur la surface expos&#233;e. Comme les rayons sont parall&#232;les (venant de 'l'infini') cette distance est &#233;gale &#224; la longueur focale.</p>
<p>Les deux figures sont juste deux points de vue diff&#233;rents dans l'espace. Le nombre de rayons trac&#233;s est bien sur arbitraire, on pourrait en dessiner une infinit&#233;. &#201;galement seuls les rayons qui nous int&#233;ressent, ceux qui passent par la lentille, sont trac&#233;s. Il y en a une infinit&#233; d'autres &#233;mient dans toutes les directions qui ne seront jamais capt&#233; par l'appareil. Les points 'source' que j'utilise ici peuvent &#234;tre consid&#233;r&#233; comme des briques &#233;l&#233;mentaires d'une image. Ce ne sont pas forc&#233;ment des sources qui &#233;mettent leur propre lumi&#232;re mais aussi chaque &#233;l&#233;ments d'une sc&#232;ne qui refl&#232;tent la lumi&#232;re dont une partie est intercept&#233; par l'appareil photo.</p>
<div class="graph">
<center>
<p><a name=ly1></a> <a href="https://www.sylvainphoto.com/p610850587/eb57514f2"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044349170-3.jpg" /></a><a href="https://www.sylvainphoto.com/p610850587/eb57514f6"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044349174-3.jpg" /></a></p>
<em>50mm f/2 Mise au point &#224; l'infinie. D&#233;tecteur Full Frame. Rayons parall&#232;les (infinie)</em>
</center>
</div>
Si les rayons ne sont pas parall&#232;les mais viennent d'un point (dit ponctuel) situ&#233; &#224; 20cm de la lentille par exemple, pour pouvoir converger les rayons sur le d&#233;tecteur il va falloir agrandir la distance <span class="math inline">\(l\)</span>, comme le montre la figure ci-dessous:
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p610850587/eb57514f9"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044349177-4.jpg" /></a></p>
<em>50mm f/2 Mise au point &#224; 20cm. Source &#224; 20cm</em>
</center>
</div>
Si jamais on laisse le d&#233;tecteur &#224; 50mm de la lentille (mise au point &#224; l'infinie) voila ce qui se passe:
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p610850587/eb57514f7"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044349175-4.jpg" /></a></p>
<em>50mm f/2 Mise au point &#224; l'infinie. Source &#224; 20cm</em>
</center>
</div>
<p>De la m&#234;me mani&#232;re si on &#233;carte trop le d&#233;tecteur de la lentille:</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p610850587/eb57514f8"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044349176-4.jpg" /></a></p>
<em>50mm f/2 Mise au point &#224; 10cm. Source &#224; 20cm</em>
</center>
</div>
<p>Les rayons qui passent par le bord de la pupille ne convergent plus sur le d&#233;tecteur mais y d&#233;crivent un cercle. Le point source ne forme plus un 'point' sur l'&#233;cran mais il forme une tache d'une certaine taille. Cette tache je l'appellerai <strong>tache de d&#233;focalisation</strong>.</p>
<p>Pour un syst&#232;me donn&#233;, math&#233;matiquement il existe qu'une seule configuration exacte de distances source-lentille et lentille-d&#233;tecteur<a href="#fn1" class="footnoteRef" id="fnref1"><sup>1</sup></a> qui donnera un 'point'. Mais m&#234;me si on s'&#233;carte de l'exactitude math&#233;matique, en d&#233;pla&#231;ant l&#233;g&#232;rement la source, par exemple, la <strong>tache de d&#233;focalisation</strong> peut rester d'une taille &quot;acceptable&quot;, c'est &#224; dire qu'elle sera imperceptible par l'observateur de la photo (voir le <a href="#chapCoc">chapitre ci-dessous</a>). L'&#233;tendue du d&#233;placement d'une source pour laquelle sa tache de d&#233;focalisation projet&#233; sur le d&#233;tecteur reste de taille &quot;acceptable&quot; est <strong>la profondeur de champs</strong>.</p>
<p>Il faut noter que m&#234;me pour une source plac&#233;e &#224; la mise au point exact, le point de convergence sera toujours dimensionn&#233;. Cette tache minuscule peut &#234;tre consid&#233;r&#233;e comme la tache <strong>minimale</strong> que peut d&#233;livrer l'appareil. Cette tache minimum sera soit d&#251; &#224; l'imperfection de l'optique, soit d&#251; &#224; un ph&#233;nom&#232;ne physique de la lumi&#232;re: <strong>la diffraction</strong>. Quoi qu'il en soit, cette tache minimum n'influence pas la profondeur de champ mais influence la qualit&#233; globale de l'image.</p>
<p>Dans l'exemple <a href="ly6">ci-dessous</a>, toujours un 50mm mais cette fois &#224; f/8, il y a 4 points sources. Comme dit pr&#233;c&#233;demment, on peut consid&#233;rer ces points comme des briques &#233;l&#233;mentaires d'une image. Dans la vraie vie il y en a des millions pour constituer une photo. La mise au point (math&#233;matiquement exacte) est faite sur le point rouge situ&#233; &#224; 1 m&#232;tre. Les sources bleu et vert sont respectivement derri&#232;re et devant le point rouge mais restent &#224; une distance suffisamment proche de la distance de mise point pour que la tache de d&#233;focalisation qu'ils d&#233;crivent sur le d&#233;tecteur reste &quot;acceptable&quot;. C'est &#224; dire que ces points apparaitront nets sur la photo contempl&#233;e. Le point en couleur cyan est lui &#224; 20cm de l'objectif, sa tache est bien plus large, il apparaitra flou sur la photo. La partie gris&#233; repr&#233;sente le volume dans lequel une source apparaitra sur le d&#233;tecteur (dans le champs de vue) et y apparait de fa&#231;on net. La deuxi&#232;me figure est un zoom sur &quot;l'appareil photo&quot;, pour la m&#234;me sc&#232;ne.</p>
<div class="graph">
<center>
<p><a name=ly6></a> <a href="https://www.sylvainphoto.com/p610850587/eb57514f4"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044349172-2.jpg" /></a> <a href="https://www.sylvainphoto.com/p610850587/eb57514fa"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044349178-2.jpg" /></a></p>
<em>50mm f/8, mise au point &#224; 1 m&#232;tre. Sources: rouge 1m, vert 0.9m, bleu 1.1m, cyan 0.2m. La partie gris&#233; est celle pour laquelle toutes sources situ&#233; &#224; l'int&#233;rieur sera imag&#233;es sur le d&#233;tecteur (dans le champ de vue) et de fa&#231;on net sur la photo. Sur la figure de gauche l'appareil photo se voit &#224; peine, la figure de droite est un zoom sur ce dernier.</em>
</Center>
</div>
<h3 id="cercle-de-confusion-tache-acceptable"><a name=chapCoc></a> Cercle de confusion (tache acceptable)</h3>
<p>Comment d&#233;finit on la taille de la tache de d&#233;focalisation dit acceptable pour que le point originaire, un &#233;l&#233;ment de la sc&#232;ne, soit consid&#233;r&#233; comme net sur une photo ?</p>
<p>On rentre dans un domaine plus subjectif et il n'y a pas qu'une seule r&#233;ponse, mais il existe des standards. La d&#233;finition que j'utilise ici, majoritairement utilis&#233;e, se base sur le fait qu'une photographie est essentiellement faite pour &#234;tre contempl&#233;e par des humains ! Je penses ne pas me tromper jusqu'ici.</p>
<p>La taille de la tache de d&#233;focalisation &quot;acceptable&quot; projet&#233; sur un photo est donc dict&#233;e par la capacit&#233; de l'oeil humain &#224; r&#233;soudre les plus petits d&#233;tails d'une photo accroch&#233;e au mur, ou visualis&#233;e sur un &#233;cran, &#224; une certaine distance. Cette taille de tache limite est le <strong>cercle de confusion</strong>.</p>
<p>La taille du cercle de confusion sur le d&#233;tecteur va donc d&#233;pendre du grandissement de la photo, c'est &#224; dire du rapport entre la taille de la photo et le d&#233;tecteur. Car toute &quot;taches&quot; imag&#233;s sur le d&#233;tecteur vont &#234;tre agrandis aux yeux du contemplateur. Comme bien sur toutes autres structures imag&#233;es sur le d&#233;tecteur. Que le d&#233;tecteur soit analogique ou num&#233;rique n'y change rien.</p>
Le sch&#233;ma ci-dessous exprime la m&#234;me chose:
<div class="graph">
<center>
<p><a name=sk1></a> <a href="https://www.sylvainphoto.com/p581346165/eb575375a"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044357978-4.jpg" /></a></p>
<em>Projection de la tache de d&#233;focalisation vue par l'oeil sur une photo. Si la projection de ce cercle ne peux pas &#234;tre r&#233;solue par l'oeil la tache est alors 'acceptable'.</em>
</center>
</div>
<p>La profondeur de champ per&#231;ue d&#233;pend donc de la taille du support de la photo et de la distance &#224; laquelle on la regarde. Les deux images <a href="#mi3">ci-dessous</a> sont un exemple un peu exag&#233;rer, &#233;vidant, mais qu'il est toujours bon de rappeler. La profondeur de champ per&#231;ue n'est pas la m&#234;me si on regarde la grande ou la petite version. De m&#234;me, estimez a l'oeil la profondeur de champ devant l'&#233;cran puis en vous reculant de 5 m&#232;tres, elle ne sera pas la m&#234;me. C'est pourtant la m&#234;me photo. La seule chose qui a chang&#233; est la taille du cercle de confusion &#224; notre oeil.</p>
<div class="graph">
<center>
<p><a name=mi3></a> <a href="https://www.sylvainphoto.com/p936299455/eb575474a"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044362058-11.jpg" /></a> <a href="https://www.sylvainphoto.com/p936299455/eb575474a"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044362058-2.jpg" /></a></p>
<p><a href="https://www.sylvainphoto.com/p936299455/eb5754741"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044362049-5.jpg" /></a></p>
<em>La sensation de profondeur de champ change avec la taille de la photo ou la distance de visionage. La taille du cercle de confusion change.</em>
</center>
</div>
<p>Pour &#233;viter de prendre en compte le support de la photo et ses dimensions on pourrait aussi d&#233;finir la taille du cercle de confusion en se basant sur la taille des photosites du d&#233;tecteur. Si le cercle est plus grand que 1 ou <span class="math inline">\(N\)</span> pixels il devient visible par le d&#233;tecteur. Cela d&#233;finirait la profondeur de champs la plus courte possible, sans qu'elle soit vraiment en rapport avec le contemplateur. La profondeur de champ potentielle d'un fichier qui dort dans un ordinateur. La profondeur de champ d&#233;pendrait aussi dans ce cas la de la taille des pixels du d&#233;tecteur.</p>
<p>Je penses que ce n'est pas une d&#233;finition tr&#232;s utile en photographie. Pour la simple raison que lorsque nous regardons une photo, nous ne voyons pas les pixels du d&#233;tecteurs. Sinon le photographe &#224; mal fait son travail ou vous &#234;tes trop pr&#233;s pour appr&#233;cier la photo dans son ensemble. Que &#231;a soit par ordinateur, par processus d'impression ou par l'oeil, ce que l'on observe sur une photo est toujours une combinaison de pixels (photosites). De plus les &#233;chelles de profondeur de champ inscrites sur certain objectifs ne prennent pas en compte la taille des pixels, bien sur.</p>
<p>Vous allez me dire que cette &#233;chelle de profondeur de champ sur les objectif ne prend pas non plus en compte la taille d'impression. Correct. Il y a donc des limites naturelles que l'on peut utiliser: celles de l'oeil humain. La distance minimale de mise au point de l'oeil va varier d'un oeil &#224; un autre ainsi qu'avec l'&#226;ge de son propri&#233;taire. Mais pour un adulte elle est en moyenne de 25cm. Il est donc inutile de consid&#233;rer une distance de visionage d'une photo &#224; moins de 25cm, car l'oeil ne pourra pas faire la mise au point sur l'image. Prenons donc <strong>une photo vue &#224; 25cm</strong>. La vision humaine &#224; un certain champ de vu (ou angle de vu). Cet angle de vue est consid&#233;r&#233; comme confortable &#224; <span class="math inline">\(60^o\)</span>. &#192; 25cm de distance <span class="math inline">\(60^o\)</span> correspond &#224; peu pr&#232;s &#224; <strong>25cm de largeur</strong>.</p>
<p>Donc nous voici avec deux &#233;l&#233;ments importants pour r&#233;soudre le probl&#232;me:</p>
<ul>
<li>La taille du cercle de confusion sur la photo contempl&#233;e est dict&#233; par ce que peut r&#233;soudre l'oeil &#224; une distance de 25cm.</li>
<li>La taille de la tache de d&#233;focalisation acceptable va aussi d&#233;pendre du facteur de grossissement entre le d&#233;tecteur et une photo de 25cm de cot&#233; (cot&#233; le plus long). cf le sch&#233;ma ci-dessus.</li>
</ul>
<p>Il nous reste un &#233;l&#233;ment &#224; d&#233;terminer c'est l'acuit&#233;, ou pouvoir de r&#233;solution, de l'oeil humain. Il existe plusieurs valeurs dans la litt&#233;rature, l'une est de consid&#233;rer que si le diam&#232;tre du cercle de confusion projet&#233; sur la photo n'est pas sup&#233;rieur &#224; 1/4 de millim&#232;tres (0.25mm = 0.01 pouce) il est n&#233;gligeable (acceptable). En r&#233;alit&#233; quelqu'un qui a une vision parfaite peut r&#233;soudre jusqu'&#224; un tiers de cette valeur (~0.08mm ou 0.0033 pouce). Mais &#231;a ne veut pas dire que le cercle de confusion devient forc&#233;ment plus g&#234;nant pour ces gens la. Un autre standard est de consid&#233;rer que l'oeil peut seulement distinguer 5 paires de lignes par millim&#232;tre &#224; une distance de 25cm. Ceci donne une &#233;quivalence de <strong>cercle de confusion projet&#233; sur la photo de 0.2mm</strong>.</p>
<p>Mais qu'importe la valeur choisie, l'int&#233;r&#234;t est ici de comprendre le principe. Dans la suite je consid&#232;re une <strong>impression de 25cm de cot&#233; et un c.d.c. acceptable de 0.2mm</strong> c'est &#224; dire <span class="math inline">\(0.2/250 = 1/1250\)</span> de la largeur (d'autre standards utilisent 1/1500 de la diagonale). Le cercle de confusion projet&#233; sur le d&#233;tecteur sera donc 1/1250 de la largeur du d&#233;tecteur.</p>
<p>Bien sur cette r&#232;gle n'est pas valable seulement pour une image de 25cm vue &#224; 25cm de distance. Lorsque on agrandit une photo c'est en g&#233;n&#233;ral pour la voir de plus loin. Une simple r&#232;gle de trois, en remettant tout &#224; l'&#233;chelle, nous montre que ceci marche aussi pour une photo de 50cm de largeur vue &#224; 50cm de distance par exemple, etc...</p>
<p>Il y a des situations (par exemple une grande photo destin&#233;e &#224; &#234;tre vu de pr&#232;s dans un mus&#233;um), o&#249; il faudra casser cette r&#232;gle. Mais dans la plus par des cas on ne connait pas la taille d'impression &#224; la prise de vue et le standard ci-dessus est un bon point de d&#233;part<a href="#fn2" class="footnoteRef" id="fnref2"><sup>2</sup></a>.</p>
<p>Dans notre standard, la formule math&#233;matique qui donne le diam&#232;tre de la tache de d&#233;focalisation acceptable sur le d&#233;tecteur est donc: <span class="math inline">\(d_{coc} = 0.2 * \frac{l_{det}}{250} = \frac{l_{det}}{1250}\)</span> avec <span class="math inline">\(l_{det}\)</span> la taille du d&#233;tecteur sur sa grande largeur.</p>
<p><em>(Plus d'info sur le cercle de confusion acceptable sur <a href="https://en.wikipedia.org/wiki/Circle_of_confusion#Circle_of_confusion_diameter_limit_in_photography">wikipedia</a> )</em></p>
<h2 id="les-param&#232;tres-qui-font-varier-la-tache-de-d&#233;focalisation">Les param&#232;tres qui font varier la tache de d&#233;focalisation</h2>
<p>Maintenant que l'on a fait de longues pr&#233;sentations on peut analyser quels sont les param&#232;tres d'un syst&#232;me photographique qui font varier la tache de d&#233;focalisation sur le d&#233;tecteur. Faisons les varier un par un.</p>
<h3 id="la-distance-de-mise-au-point">La distance de mise au point</h3>
<p>La distance du sujet ou la distance de mise au point (qui va &#234;tre d&#233;termin&#233; dans notre syst&#232;me simplifi&#233; par la longueur focal de l'objectif <span class="math inline">\(M\)</span> et la distance lentille-d&#233;tecteur) influe sur la taille de la tache de d&#233;focalisation de points fixes dans l'espace. Dans le gif anim&#233; ci dessous la distance du sujet (rayons rouges) change, l'appareil photo fait la mise au point sur la source 'rouge'. Les rayons verts viennent d'une source situ&#233;e loin derri&#232;re dans le fond. Seulement 3 rayons par sources bien choisi sont trac&#233;s pour des questions de visibilit&#233;.</p>
<p>(<em>Cliquez sur le gif pour ouvrir une gallerie et voir les clich&#233;s un par un</em>)</p>
<div class="graph">
<center>
<p><a name=coc_d1></a> <a href="https://www.sylvainphoto.com/p743168716"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044364231.gif" /></a></p>
<em>50mm f/1.4. Les rayons rouges viennent d'une source mouvante (de 30m &#224; 25cm), les rayon verts viennent d'une source fixe loin derri&#232;re. La mise au point est faite &#224; chaque fois sur la source rouge</em>
</center>
</div>
<p>On voit sur cette animation que plus le sujet est proche, plus la tache de la source du fond grandira, c'est &#224; dire que le fond sera plus flou. Il existe une distance de mise au point pour laquelle toutes sources situ&#233;es derri&#232;re d&#233;criront une tache inf&#233;rieur au cercle de confusion, c'est <strong>l'hyperfocale</strong>.</p>
<p>Maintenant regardons un autre exemple, au lieu d'avoir un point fixe dans le fond on consid&#232;re ci-dessous trois sources qui bougent ensemble. La mise au point est toujours faite sur le point rouge, le point vert est situ&#233; 10 m&#232;tres derri&#232;re et le point bleu un m&#232;tre devant.</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p732123112"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044372297.gif" /></a></p>
<em>Les rayons rouges viennent d'une source mouvante situ&#233;e &#224; la distance de mise au point, les rayon verts viennent d'une source qui resterait 10 m&#232;tres derri&#232;re la rouge (et 2 m&#232;tres au dessus) et la bleu 1 m&#232;tre devant (5cm dessous). Les spots bleu et vert sur le d&#233;tecteur se d&#233;placent verticalement &#224; cause du grossissement (le sujet constitu&#233; des trois points prend plus de place sur la photo car il se rapproche)</em>
</center>
</div>
<p>On voit que la tache du point derri&#232;re et devant augmente lorsque la distance de mise au point diminue. Les illustrations photographique vous les connaissez.</p>
<p>Voici la m&#234;me information mais sous forme de graphique:</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p732123112"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044372296-5.jpg" /></a></p>
<em>Taille de la tache de d&#233;focalisation sur le d&#233;tecteur d'une source situ&#233;e 10m derri&#232;re la distance de mise au point (vert) et d'une source situ&#233;e 1 m&#232;tre devant (bleu) en fonction de la distance de mise au point</em>
</center>
</div>
<h3 id="louverture">L'ouverture</h3>
<p>Changeons maintenant l'ouverture en gardant la focale et la distance du sujet constantes, toujours avec trois points, l'un au foyer, l'un 10m derri&#232;re, l'autre 0.5m devant:</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p776202574"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044380509.gif" /></a></p>
<em>Objectif de 50mm. Les rayons rouge viennent d'une source situ&#233;e &#224; un m&#232;tre, les rayon verts viennent d'une source &#224; 10 m&#232;tres et la bleu &#224; 0.5m. La mise au point est faite sur la source rouge. Seule l'ouverture de la lentille change.</em>
</center>
</div>
<p>C'est un secret pour personne, la tache de d&#233;focalisation augmente lorsque on augmente la taille de la pupille. C'est &#224; dire lorsqu'on diminue le nombre-f. Le graphique ci-dessous montre la m&#234;me chose:</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p776202574"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044380510-5.jpg" /></a></p>
<em>Taille de la tache de d&#233;focalisation sur le d&#233;tecteur en fonction du nombre-f pour une source situ&#233;e 10m derri&#232;re (en vert) et 0.5m devant (bleu) l'appareil photo. La mise au point est faite &#224; un m&#232;tre avec un objectif de 50mm</em>
</center>
</div>
<h3 id="la-longueur-focale">La longueur focale</h3>
<p>Regardons un premier cas o&#249; le diam&#232;tre de la pupille ne change pas, c'est &#224; dire que le nombre-f change avec la longueur focale:</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p757054801"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044383020.gif" /></a></p>
<p><a href="https://www.sylvainphoto.com/p757054801"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044383021-5.jpg" /></a></p>
<em>Les rayons rouges viennent d'une source situ&#233;e &#224; un m&#232;tre, les rayons verts viennent d'une source &#224; 10 m&#232;tres et la bleu &#224; 0.5m. La focale de l'objectif change ainsi que la distance lentille-d&#233;tecteur pour la mise au point sur la source rouge. Le diam&#232;tre de la pupille reste le m&#234;me donc le nombre-f change.</em>
</center>
</div>
<p>Puis lorsque l'on consid&#232;re un nombre-f constant, c'est &#224; dire que le diam&#232;tre de la pupille varie avec la focale.</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p811604176"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044391559.gif" /></a></p>
<p><a href="https://www.sylvainphoto.com/p811604176"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044391569-5.jpg" /></a></p>
<em>Les rayons rouges viennent d'une source situ&#233;e &#224; un m&#232;tre, les rayons verts viennent d'une source &#224; 10 m&#232;tres et la bleu &#224; 0.5m de l'appareil. La focale de l'objectif change ainsi que la distance lentille-d&#233;tecteur pour la mise au point sur la source rouge. Le diam&#232;tre de la pupille change &#233;galement pour que le nombre-f reste constant</em>
</center>
</div>
<p>Lorsque le nombre-f reste constant et que la focale augmente, la tache de d&#233;focalisation augmente consid&#233;rablement jusqu'&#224; m&#234;me, dans cet exemple, devenir aussi gros que le d&#233;tecteur. Certains d'entre vous on surement prit des photos avec un t&#233;l&#233;objectif &#224; longue focale &#224; travers un grillage sans qu'il ne se voit sur la photo. L'explication est que la tache de d&#233;focalisation des &#233;l&#233;ments du grillage sont plus grand que le d&#233;tecteurs et ne se voient donc pas. Un opticien vous dira: &quot;il ne se voit pas sur la plan focal parce-que le grillage est proche du plan pupille&quot;.</p>
<h3 id="taille-du-d&#233;tecteur">Taille du d&#233;tecteur</h3>
<p>Rien a signaler, le tache de d&#233;focalisation projet&#233; sur le plan focal &#224; une taille physique ind&#233;pendante du d&#233;tecteur.</p>
<h2 id="les-param&#232;tres-qui-font-varier-la-profondeur-de-champ">Les param&#232;tres qui font varier la profondeur de champ</h2>
<p>On a vu plus haut que la profondeur de champ va d&#233;pendre du cercle de confusion projet&#233; sur la photographie et donc de la taille limite de la tache de d&#233;focalisation. Dans les cas qui suivent je consid&#232;res que on s'int&#233;resse &#224; la profondeur de champ de photos de taille identique contempl&#233;es &#224; la m&#234;me distance. Ou autrement dit. C'est le seul param&#232;tre que je ne ferais pas changer car je consid&#232;re que la photo de taille x repr&#233;sente le but &#224; atteindre.</p>
<p>Il va de soi que tout les param&#232;tres qui changent la taille de la tache de d&#233;focalisation changent la profondeur de champs: distance de mise au point, ouverture et longueur focale de l'objectif. Faisons les varier encore un par un en s'appuyant sur des exemples.</p>
<h3 id="distance-de-mise-au-point">Distance de mise au point</h3>
<p>Un premier exemple avec un objectif <em>classique</em>, avec une grosse ouverture, un 50mm f/1.4 qui correspond au <a href="#coc_d1">gif anim&#233;</a> vu pr&#233;c&#233;demment.</p>
<div class="graph">
<center>
<p><a name=dof_fd1></a> <a href="https://www.sylvainphoto.com/p916033699/eb575d4fb"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398331-5.jpg" /></a></p>
<em>50mm f/1.4 Full Frame. en faisant varier la distance de mise au point (la distance du sujet). &#192; gauche est repr&#233;sent&#233; la r&#233;gion (en bleu) de distance pour laquelle les &#233;l&#233;ments apparaitront au foyer pour le contemplateur de la photo. &#192; droite, c'est la profondeur de champs (c'est la largeur de la zone bleu pour chaque distance de mise au point).</em>
</center>
</div>
<p>Bien sur, plus le sujet est loin plus la profondeur de champ sera grande.</p>
<p>Un deuxi&#232;me exemple ci-dessous pour un objectif plus ferm&#233;, toujours un 50mm mais &#224; f/8. On voit que pour une certaine distance de mise au point, environ 11m, tout les &#233;l&#233;ments derri&#232;re, apparaitront au foyer sur la photo. C'est <strong>l'hyperfocale</strong> (dans l'exemple <a href="#dof_fd1">pr&#233;c&#233;dent</a> l'hyperfocale est de 62m, en dehors du graphique).</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4f9"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398329-5.jpg" /></a></p>
<em>50mm f/8 FF. L'hyperfocale est &#224; ~11m</em>
</center>
</div>
<h3 id="ouverture">Ouverture</h3>
<p>Voici les m&#234;mes figures que pr&#233;c&#233;demment mais cette fois en fixant la distance de mise au point et en faisant varier l'ouverture (le diam&#232;tre de la pupille puisque la focale est fixe). Pour deux cas de figure classiques :</p>
<ul>
<li>Portrait: un 85mm sur un Full Frame avec une distance de mise au point de 3m</li>
<li>Paysage avec premier plan: un 24mm sur un Full Frame, distance de mise au point de 1m</li>
</ul>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4ee"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398318-5.jpg" /></a></p>
<em>85mm sur FF. Distance de mise au point 3m. Configuration portrait</em>
</center>
</div>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4ef"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398319-5.jpg" /></a></p>
<em>24mm sur FF. Distance de mise au point 1m. Configuration paysage avec premier plan</em>
</center>
</div>
<p>On voit sur la deuxi&#232;me figure que pour des ouverture plus petites que ~f/19 tout les point apr&#232;s 0.5m de la cam&#233;ra vont apparaitre au foyer sur la photo. &#192; f/32 virtuellement tout va &#234;tre au foyer.</p>
<h3 id="la-longueur-focale-de-lobjectif">La longueur focale de l'objectif</h3>
<p>En prenant comme pr&#233;c&#233;demment un premier cas ou la pupille &#224; un diam&#232;tre constant (25mm dans cet exemple):</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4f8"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398328-5.jpg" /></a></p>
<em>Objectif avec une pupille de 25mm sur un FF. Le nombre-f et la focale varient. La distance de mise au point est de 1m.</em>
</center>
</div>
<p>Puis dans le cas ou le nombre-f reste constant (la taille de la pupille varie donc avec la focale).</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4fe"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398334-5.jpg" /></a></p>
<em>f/2 sur un FF. Le diam&#232;tre de la pupille et la focale varies. La distance de mise au point est de 1m.</em>
</center>
</div>
<p>Comme attendu la zone de distance ou les objets apparaissent au foyer se raccourci tr&#232;s vite lorsque la longueur focale augmente &#224; nombre-f constant.</p>
<h3 id="la-taille-du-d&#233;tecteur">La taille du d&#233;tecteur</h3>
<p>Si nous gardons tout les param&#232;tres (nombre-f, focale, distance de mise au point, taille de la photo) constant sauf un seul, la taille du d&#233;tecteur, que va t'il se passer ? Lorsque on diminue que la taille du capteur, si on propose &#224; quelqu'un les trois possibilit&#233;s:</p>
<ul>
<li><em>a)</em> la profondeur de champ devient plus longue</li>
<li><em>b)</em> la profondeur de champ reste la m&#234;me</li>
<li><em>c)</em> la profondeur de champ devient plus courte.</li>
</ul>
<p>Je suis certain que la plus part des gens vont vous r&#233;pondre <em>a)</em> ou <em>b)</em> alors que la vraie r&#233;ponse est <em>c)</em>.</p>
<p>La seule chose qui change vraiment dans ce cas pr&#233;cis c'est le facteur de grandissement entre le d&#233;tecteur et la photo. La tache de d&#233;focalisation pour un certain point source inscrit sur le d&#233;tecteur &#233;tant inchang&#233;, lorsqu'on augmente le grandissement (diminue la taille du capteur) on cette tache projet&#233;e sur la photo. Ou autrement dit la proportion de la tache de d&#233;focalisation relative &#224; la taille du d&#233;tecteur augmente.</p>
<p>On peut comparer ci-dessous la profondeur de champ pour un 84mm en fonction de l'ouverture, lorsque la mise au point est faite &#224; 3m, pour un Full Frame (36x24 mm) et un APS-C (23.6x15.7 mm).</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4fa"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398330-5.jpg" /></a></p>
<em>84mm mise au point &#224; 3m pour un Full Frame (rouge) et pour un APS-C (vert). La profondeur de champ est plus courte pour l'APS-C</em>
</center>
</div>
<p>On peut aussi regarder la variation de la profondeur de champ en fonction de la largeur du d&#233;tecteur (sa dimension la plus grande). Ci-dessous la voici repr&#233;sent&#233; avec un graphique suppl&#233;mentaire qui donne l'angle de vue de l'image (sur la dimension la plus grande). Deux exemples sont donn&#233;s pour un 50mm f/1.4 et pour un grand angle, un 24mm f/2.8.</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4f3"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398323-5.jpg" /></a></p>
<em>50mm f/1.4 mise au point &#224; 1m. Le graphique &#224; droite donne l'angle de vue</em>
</center>
</div>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4ec"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398316-5.jpg" /></a></p>
<em>24mm f/2.8 mise au point &#224; 3m. Le graphique &#224; droite donne l'angle de vue</em>
</center>
</div>
<h3 id="taille-du-d&#233;tecteur-pour-des-photos-identiques">Taille du d&#233;tecteur pour des photos identiques</h3>
<p>Le fait que la profondeur de champs diminue lorsque la taille du d&#233;tecteur diminue semble pourtant contre intuitif. En effet les photos prisent avec un t&#233;l&#233;phone portable par exemple ont en g&#233;n&#233;ral une profondeur de champ plus grande que des photos prisent avec un reflex plein format.</p>
<p>Ceci est d&#251; au fait que la longueur focale des objectifs utilis&#233;s ne sont pas les m&#234;mes (environ 5mm pour un t&#233;l&#233;phone portable) afin de conserver un champ de vu &#233;quivalent &#224; ~30mm sur un Full Frame.</p>
<p>Voici dans un premier temps le graphique qui montre la profondeur de champ en fonction de l'ouverture d'un 84mm mont&#233; sur un Full Frame et d'un 56mm mont&#233; sur un APS-C. Le champ de vu est le m&#234;me et la distance de mise au point est identique.</p>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4f5"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398325-5.jpg" /></a></p>
<em>Distance de nettet&#233; et profondeur de champ en fonction du nombre-f pour un 84mm sur un Full Frame et un 56mm sur un APS-C</em>
</center>
</div>
<p>On voit que pour une ouverture identique la profondeur de champs est plus grande sur un plus petit d&#233;tecteurs lorsque on compense le champ de vu par la focale.</p>
<p>On peut s'int&#233;resser maintenant aux param&#232;tres de syst&#232;mes dont le but serait de produire la m&#234;me photo, d'une m&#234;me sc&#232;ne, lorsque la taille du d&#233;tecteur change. Pour cela il faut:</p>
<ul>
<li><strong>a.</strong> garder les m&#234;me perspectives: il faut que la distance sujet - cam&#233;ra reste constante</li>
<li><strong>b.</strong> garder le m&#234;me cadrage: la focale devra changer &#224; cause de <strong>a.</strong> et du fait que le d&#233;tecteur est plus ou moins petit.</li>
<li><strong>c.</strong> garder la profondeur de champ: la proportion de la taille des taches de d&#233;focalisation par rapport &#224; la taille du d&#233;tecteur doit &#234;tre conserv&#233;. &#192; cause de <strong>a.</strong> qui implique de ne pas bouger et <strong>b.</strong> qui fixe la focale, la seule solution est de jouer sur l'ouverture.</li>
</ul>
<p>Voici l'animation qui montre ce changement de param&#232;tres avec une source rouge &#224; 0.5m de l'appareil photo, une source verte plac&#233;e loin derri&#232;re. La mise au point &#233;tant faite sur la source rouge.</p>
<div class="graph">
<center>
<p><a name=coc_det1></a> <a href="https://www.sylvainphoto.com/p1040037852"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044451837.gif" /></a></p>
<em>Ici tous les param&#232;tres changent (sauf la sc&#232;ne et la distance sujet - lentille) dans le but de cr&#233;er la m&#234;me photo. La proportion de la tache de d&#233;focalisation par rapport au d&#233;tecteur reste inchang&#233;.</em>
</center>
</div>
<p>Ce qui est remarquable en optique c'est que les param&#232;tres distance focale, nombre-f, et taille du d&#233;tecteur sont proportionnels les un aux autres. Pour obtenir un syst&#232;me avec les m&#234;mes performances, si on diminue les c&#244;tes du d&#233;tecteur par 2, on diminue la focale par 2 et on diminue le nombre-f par 2. On le voit bien sur l'animation ci-dessus, la taille de la pupille ne change pas. Hors c'est elle qui d&#233;limite la surface collectrice de la lumi&#232;re (par d&#233;finition) et donc pour une m&#234;me taille de pupille, pour le m&#234;me champ de vu, la quantit&#233; de lumi&#232;re collect&#233; sera la m&#234;me.</p>
<p>Un autre miracle de la physique nous montre que si la sensibilit&#233; de surface et la m&#234;me (c'est vrai pour des d&#233;tecteurs de m&#234;me g&#233;n&#233;rations), en conservant la quantit&#233; de lumi&#232;re totale on conserve la quantit&#233; de bruit sur la photo. Pour le comprendre voici un autre article: <a href="https://www.sylvainphoto.com/lumiere-bruit-detecteurs">La lumi&#232;re le bruit et les d&#233;tecteurs</a></p>
<p>Si les caract&#233;ristiques de profondeur de champs, de champ de vue et de quantit&#233; de lumi&#232;re collect&#233; sont les m&#234;mes, les syst&#232;mes avec de gros d&#233;tecteurs pr&#233;sentent ce-pendant des avantages, que l'on peut comprendre en regardant <a href="#coc_det1">l'animation</a>:</p>
<ul>
<li>La lumi&#232;re est plus dilu&#233;e dans le cas d'un grand d&#233;tecteur. Ceci repr&#233;sente des avantages de dynamiques. Les pixels ont une <a href="https://www.sylvainphoto.com/lumiere-bruit-detecteurs">capacit&#233; de collecte de lumi&#232;re limit&#233;</a>, en diluant le flux on atteindra moins vite cette limite.</li>
<li>Le nombre de pixel. Ils ne sont pas infiniment compressibles, on peut facilement en mettre plus sur un grand d&#233;tecteur, pour pouvoir imprimer plus grand.</li>
<li>Avec un grand d&#233;tecteur les rayons arrivent avec un angle d'incidence moins &#233;lev&#233; (nombre-f plus petit). Hors l'efficacit&#233; des pixels chute lorsque cet angle devient trop &#233;lev&#233;.</li>
<li>La qualit&#233; optique est plus facile &#224; r&#233;aliser pour des objectifs de focale longue et nombre-f petit (chromatisme, correction de bord de champs, etc).</li>
</ul>
<p>En prenant du recul sur la gammes des appareils et objectifs actuels, on voit bien que lorsque les constructeurs mettent des petits d&#233;tecteurs dans leur syst&#232;me c'est pour les rendre plus compactes au sacrifice de la profondeur de champs extr&#234;me et de la quantit&#233; de lumi&#232;re (=le bruit). Contrairement &#224; l'animation ci-dessous ils vont diminuer la taille de la pupille en s'accrochant sur un &#233;l&#233;ment vendeur mais trompeur que le nombre-f sera le m&#234;me. Par exemple un 50mm f/1.4 &#224; une pupille plus petite que un 75mm f/1.4, appair&#233; &#224; un APS-C il aura une profondeur de champ plus longue, une capacit&#233; de captage de lumi&#232;re moindre que le 75mm f/1.4 sur un full frame.</p>
<p>Voici l'animation qui correspond plus &#224; la r&#233;alit&#233; du march&#233;, la r&#233;duction de taille est un compromis.</p>
<div class="graph">
<center>
<p><a name=coc_det2></a> <a href="https://www.sylvainphoto.com/p664513970"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044457094.gif" /></a></p>
<em>Ici la taille du d&#233;tecteur change ainsi que la focale mais pas le nombre-f. La profondeur de champ change (la tache de d&#233;focalisation occupe ~50% de la largeur du grand d&#233;tecteur &#224; 84mm f2.0, alors qu'il en occupe qu'une petite fraction sur un petit d&#233;tecteur). L'animation 3d ressemble presque &#224; un effet de zoom mais &#231;a n'en est pas un.</em>
</center>
</div>
<div class="graph">
<center>
<p><a href="https://www.sylvainphoto.com/p916033699/eb575d4f1"><img src="https://www.sylvainphoto.com/img/s/v-3/p3044398321-5.jpg" /></a></p>
<em>Graphique montrant la distance de nettet&#233;, profondeur de champs et pouvoir collecteur (en prenant la configuration Full Frame comme r&#233;f&#233;rence). La longueur focale est ajust&#233;e (m&#234;me champ de vue) mais le nombre-f ne varie pas (pupille de diam&#232;tre variable). L'axe des x est en &quot;crop facteur&quot; descendant, c'est &#224; dire en taille de d&#233;tecteur augmentant.</em>
</center>
</div>
<p>Bien sur tout cela n'est pas seulement de la th&#233;orie est peut facilement &#234;tre v&#233;rifier avec un boitier et deux objectifs par exemple. On peut toujours cr&#233;er virtuellement des d&#233;tecteurs plus petits en d&#233;coupant les images. Voici quatre images prisent avec un Fujifilm x-pro2. Deux sont prise avec un 35mm sur l'ensemble du d&#233;tecteur, deux autres avec un 16mm et la moiti&#233; (le quart en surface) du d&#233;tecteur. Le champ de vue est le m&#234;me. Les profondeurs de champ (et bruits) sont proches lorsque le nombre-f est compens&#233; d'un facteur deux pour <strong>A.</strong> avec <strong>B.</strong> et <strong>C.</strong> avec <strong>D.</strong>, par paire le diam&#232;tre de la pupille est identique. <strong>A.</strong> et <strong>D.</strong> ont le m&#234;me nombre-f mais une profondeur de champ diff&#233;rente.</p>
<center>
<table class="graphtbl">
<tr>
<td>
<a href="http://sylvainphoto.com/equivalence-2/e9d7e836b"><img src="http://www.sylvainphoto.com/img/s5/v118/p2642314091-2.jpg" /></a>
</td>
<td>
<a href="http://sylvainphoto.com/equivalence-2/e9d7e841d"><img src="http://www.sylvainphoto.com/img/s1/v20/p2642314269-2.jpg" /></a>
</td>
</tr>
<tr>
<td>
<strong>A.</strong> 35mm f/3.2 iso 1600 (d&#233;tecteur entier)
</td>
<td>
<strong>B.</strong> 16mm f/1.6 iso 400 (1/4 du d&#233;tecteur)
</td>
</tr>
<tr>
<td>
<a href="http://sylvainphoto.com/equivalence-2/e9d7e8392"><img src="http://www.sylvainphoto.com/img/s1/v21/p2642314130-2.jpg" /></a>
</td>
<td>
<a href="http://sylvainphoto.com/equivalence-2/e9d7e83cb"><img src="http://www.sylvainphoto.com/img/s1/v22/p2642314187-2.jpg" /></a>
</td>
</tr>
<tr>
<td>
<strong>C.</strong> 35mm f/6.4 iso 6400 (d&#233;tecteur entier)
</td>
<td>
<strong>D.</strong> 16mm f/3.2 iso 1600 (1/4 du d&#233;tecteur)
</td>
</tr>
</table>
</center>
<p>Des questions, des remarques constructives, n'h&#233;sitez pas &#224; les exprimer ci-dessouss. Les gif anim&#233;s peuvent &#234;tre utilis&#233;s &#224; votre guise, ils valent parfois plus que des mots pour alimenter des discussions.</p>
<!--
[ly1_p]: Img/Opt/layout/50mm_f2_inf.png
[ly1_l]: Img/Opt/layout/50mm_f2_inf.png
[ly2_p]: Img/Opt/layout/50mm_f2_inf_3d.png
[ly2_l]: Img/Opt/layout/50mm_f2_inf_3d.png
[ly3_p]: Img/Opt/layout/50mm_f2_20cm.png
[ly3_l]: Img/Opt/layout/50mm_f2_20cm.png
[ly4_p]: Img/Opt/layout/50mm_f2_20cm_focInf.png
[ly4_l]: Img/Opt/layout/50mm_f2_20cm_focInf.png
[ly5_p]: Img/Opt/layout/50mm_f2_20cm_foc10cm.png
[ly5_l]: Img/Opt/layout/50mm_f2_20cm_foc10cm.png
[ly6_p]: Img/Opt/layout/50mm_f8_3points.png
[ly6_l]: Img/Opt/layout/50mm_f8_3points.png
[ly7_p]: Img/Opt/layout/50mm_f8_3points_zoomed.png
[ly7_l]: Img/Opt/layout/50mm_f8_3points_zoomed.png

[sk1_p]: Img/opt/sketches/sketches.001.png
[sk1_l]: Img/opt/sketches/sketches.001.png

[mi1_p]: Img/Opt/misc/dof_photo_gre.jpg
[mi1_l]: Img/Opt/misc/dof_photo_gre.jpg

[mi2_p]: Img/Opt/misc/dof_photo_gre_mini.jpg
[mi2_l]: Img/Opt/misc/dof_photo_gre_mini.jpg

[coc_d1_p]: Img/opt/coc_focal_distance_background/coc_foc_dist.gif
[coc_d1_l]: Img/opt/coc_focal_distance_background/coc_foc_dist.gif

[coc_d2_p]: Img/opt/coc_focal_distance_follow/coc_foc_dist.gif
[coc_d2_l]: Img/opt/coc_focal_distance_follow/coc_foc_dist.gif

[coc_d3_p]: Img/opt/coc_focal_distance_follow/coc_focal_distance_follow_graph.png
[coc_d3_l]: Img/opt/coc_focal_distance_follow/coc_focal_distance_follow_graph.png

[coc_f1_p]: Img/opt/coc_aperture/coc_aperture.gif
[coc_f1_l]: Img/opt/coc_aperture/coc_aperture.gif

[coc_f2_p]: Img/opt/coc_aperture/coc_aperture.png
[coc_f2_l]: Img/opt/coc_aperture/coc_aperture.png

[coc_fcd1_p]: Img/opt/coc_focal_d/coc_focal_d.gif
[coc_fcd1_l]: Img/opt/coc_focal_d/coc_focal_d.gif
[coc_fcd2_p]: Img/opt/coc_focal_d/coc_focal_d_graph.png
[coc_fcd2_l]: Img/opt/coc_focal_d/coc_focal_d_graph.png

[coc_fcf1_p]: Img/opt/coc_focal_f/coc_focal.gif
[coc_fcf1_l]: Img/opt/coc_focal_f/coc_focal.gif
[coc_fcf2_p]: Img/opt/coc_focal_f/coc_focal_f_graph.png
[coc_fcf2_l]: Img/opt/coc_focal_f/coc_focal_f_graph.png

[dof_fd1_p]: Img/opt/dof/dof_focal_distance_graph.png
[dof_fd1_l]: Img/opt/dof/dof_focal_distance_graph.png
[dof_fd2_p]: Img/opt/dof/dof_focal_distance_50mm_f8_graph.png
[dof_fd2_l]: Img/opt/dof/dof_focal_distance_50mm_f8_graph.png

[dof_f1_p]: Img/opt/dof/dof_fnumber_85mm_graph.png
[dof_f1_l]: Img/opt/dof/dof_fnumber_85mm_graph.png

[dof_f2_p]: Img/opt/dof/dof_fnumber_24mm_graph.png
[dof_f2_l]: Img/opt/dof/dof_fnumber_24mm_graph.png

[dof_fcd1_p]: Img/opt/dof/dof_focal_d_graph.png
[dof_fcd1_l]: Img/opt/dof/dof_focal_d_graph.png

[dof_fcf1_p]: Img/opt/dof/dof_focal_f_graph.png
[dof_fcf1_l]: Img/opt/dof/dof_focal_f_graph.png

[dof_det1_p]: Img/opt/dof/dof_fnumber_ff_apsc_84mm_graph.png
[dof_det1_l]: Img/opt/dof/dof_fnumber_ff_apsc_84mm_graph.png

[dof_det2_p]: Img/opt/dof/dof_det_50mm_f1_4_1m_graph.png
[dof_det2_l]: Img/opt/dof/dof_det_50mm_f1_4_1m_graph.png

[dof_det3_p]: Img/opt/dof/dof_det_24mm_f2_8_3m_graph.png
[dof_det3_l]: Img/opt/dof/dof_det_24mm_f2_8_3m_graph.png

[dof_det4_p]: Img/opt/dof/dof_fnumber_ff_apsc_84_56mm_graph.png
[dof_det4_l]: Img/opt/dof/dof_fnumber_ff_apsc_84_56mm_graph.png

[coc_det1_p]: Img/opt/coc_detector/coc_detector.gif
[coc_det1_l]: Img/opt/coc_detector/coc_detector.gif

[coc_det2_p]: Img/opt/coc_detector2/coc_detector2.gif
[coc_det2_l]: Img/opt/coc_detector2/coc_detector2.gif

[dof_det5_p]: Img/opt/dof_det_84mm_f2_3m_ctefov_graph.png
[dof_det5_l]: Img/opt/dof_det_84mm_f2_3m_ctefov_graph.png
-->
<div class="footnotes">
<hr />
<ol>
<li id="fn1"><p>Sur un objectif photo normal la mise au point est aussi faite en d&#233;pla&#231;ant une lentille ou un block de lentille. La distance source-lentille de notre syst&#232;me simplifi&#233; se traduit par une distance source-centre optique de l'objectif. La position du centre optique va d&#233;pendre de la formule optique utilis&#233;e.<a href="#fnref1">&#8617;</a></p></li>
<li id="fn2"><p>On pourrait &#233;galement consid&#233;rer le support, si la photo est vue sur un mauvais &#233;cran (pas r&#233;tina) avec des pixels plus larges que 0.2mm on pourrait se baser sur la taille des pixels de l'&#233;cran, mais &#231;a serait se compliquer la vie.<a href="#fnref2">&#8617;</a></p></li>
</ol>
</div>
</body>
</html>
